lee123kkk/stm32/IAR_Embedded_Workbench/TIM3_UpCounting(1ms INT).c
/////////////////////////////////////////////////////////////
// 사용하는 Mode: Up Counting Mode
// 사용하는 Timer: Timer3 
// 사용하는 인터럽트: Update Interrupt(UI) 발생 (1ms) 
/////////////////////////////////////////////////////////////
#include "stm32f4xx.h"
#include "GLCD.h"

#define SW0_PUSH        0xFE00  //PH8
#define SW1_PUSH        0xFD00  //PH9
#define SW2_PUSH        0xFB00  //PH10
#define SW3_PUSH        0xF700  //PH11
#define SW4_PUSH        0xEF00  //PH12
#define SW5_PUSH        0xDF00  //PH13
#define SW6_PUSH        0xBF00  //PH14
#define SW7_PUSH        0x7F00  //PH15

void _RCC_Init(void);
void _GPIO_Init(void);
void _EXTI_Init(void);
uint16_t KEY_Scan(void);
void TIMER3_Init(void);  // Timer3 초기화  //원본코드
void TIMER5_Init(void);  // Timer5 초기화  //추가한 코드


void DisplayInitScreen(void);

void DelayMS(unsigned short wMS);
void DelayUS(unsigned short wUS);
void BEEP(void);

uint8_t	SW0_Flag, SW1_Flag;
uint8_t	SW6_Flag, SW7_Flag;

int main(void)
{
	_GPIO_Init();  		// GPIO 초기화
	_EXTI_Init();		// 외부인터럽트 초기화
	LCD_Init();		// GLCD 초기화
	DelayMS(10);			
	BEEP();			// Beep 한번 

	GPIOG->ODR &= 0xFF00;	// 초기값: LED0~7 Off
	DisplayInitScreen();		// LCD 초기화면

	TIMER3_Init();		// 범용타이머(TIM3) 초기화 : up counting mode    //원본코드
//        TIMER5_Init();		// 범용타이머(TIM3) 초기화         //추가한 코드
	while(1)
	{
		switch(KEY_Scan())
		{
			case 0xBF00 : 	//SW6
				if (SW6_Flag==0) {
					GPIOG->ODR |= 0x0040; // LED6 ON		
					LCD_DisplayText(3,0,"LED6 On ");
					SW6_Flag = 1;
				}
				else {
					GPIOG->ODR &= ~0x0040; // LED6 OFF
					LCD_DisplayText(3,0,"LED6 Off");
					SW6_Flag = 0;
				}
			break;
			case SW7_PUSH : //SW7
				if (SW7_Flag==0) {
					GPIOG->ODR |= (1<<7); // LED7 ON
					LCD_DisplayText(4,0,"LED7 On ");
					SW7_Flag = 1;
				}
				else {
					GPIOG->ODR &= ~(1<<7); // LED7 OFF
					LCD_DisplayText(4,0,"LED7 Off");
					SW7_Flag = 0;
				}
			break;
		}  // switch(KEY_Scan())
        
		//EXTI SW0가 High에서 Low가 될 때 (Falling edge Trigger mode) LED0 toggle
		if(SW0_Flag)
		{
			GPIOG->ODR ^= 0x01;
			if ((GPIOG->ODR & 0x01) == 0x01)
				LCD_DisplayText(1,0,"LED0 On ");	// LCD 표시
			else
				LCD_DisplayText(1,0,"LED0 Off");	// LCD 표시
			SW0_Flag = 0;
		}
		//EXTI SW1가 High에서 Low가 될 때 (Rising edge Trigger mode) LED1 toggle
		if(SW1_Flag)
		{
			GPIOG->ODR ^= 0x02;
			if ((GPIOG->ODR & 0x02) == 0x02)
				LCD_DisplayText(2,0,"LED1 On ");	// LCD 표시
			else
				LCD_DisplayText(2,0,"LED1 Off");	// LCD 표시
			SW1_Flag = 0;
		}
	}
}
    //원본코드
void TIMER3_Init(void)   
{
// Enable Timer CLK 
	RCC->APB1ENR |= 0x02;	// RCC_APB1ENR TIMER3 Enable

// Setting CR1 : 0x0000 
//	TIM3->CR1 &= ~(1<<4);	// DIR=0(Up counter)(reset state)      //원본 코드  (TIM3의 DIR(4번핀)의 값이 0)
    TIM3->CR1 |= (1<<4);	// DIR=0(down  counter)(reset state) //수정한 코드     (TIM3의 DIR(4번핀)의 값이 1)   

	TIM3->CR1 &= ~(1<<1);	// UDIS=0(Update event Enabled): By one of following events
				//   - Counter Overflow/Underflow, 
				//   - Setting the UG bit Set,
				//   - Update Generation through the slave mode controller 
				// UDIS=1 : Only Update event Enabled by Counter Overflow/Underflow,
	TIM3->CR1 &= ~(1<<2);	// URS=0(Update Request Source  Selection): By one of following events
				//   - Counter Overflow/Underflow, 
				//   - Setting the UG bit Set,
				//   - Update Generation through the slave mode controller 
				// URS=1 : Only Update Interrupt generated By Counter Overflow/Underflow,
	TIM3->CR1 &= ~(1<<3);	// OPM=0(The counter is NOT stopped at update event) (reset state)
	TIM3->CR1 &= ~(1<<7);	// ARPE=0(ARR is NOT buffered) (reset state)
	TIM3->CR1 &= ~(3<<8); 	// CKD(Clock division)=00(reset state)
	TIM3->CR1 &= ~(3<<5); 	// CMS(Center-aligned mode Sel)=00 (Edge-aligned mode) (reset state)
				// Center-aligned mode: The counter counts UP and DOWN alternatively

// Deciding the Period
	TIM3->PSC = 8400-1;	// Prescaler 84,000,000Hz/8400 = 10,000 Hz (0.1ms)  (1~65536) / /원본코드
//      TIM3->PSC = 16800-1;	// Prescaler 84,000,000Hz/16800 = 5,000 Hz (0.2ms) / /수정된 코드
//         TIM3->PSC = 42000-1       ;// Prescaler 84,000,000Hz/42000 = 2,000 Hz (0.5ms) / /수정된 코드


//	TIM3->ARR = 10-1;		// Auto reload  0.1ms * 10 = 1ms (원래 코드 부분)
//     TIM3->ARR = 40-1;		// Auto reload  0.1ms * 40 = 4ms //수정된 코드
//      TIM3->ARR = 5000-1;	    //추가한 코드  0.1ms *5000=500ms=0.5s
//      TIM3->ARR = 100000-1;	 //추가한 코드 65535를 넘는 값이므로 정상적으로 작동하지 않음
//      TIM3->ARR = 50000-1;           //추가한 코드  0.2 & 50000 = 10s (psc=16800일떄)
     TIM3->ARR = 1000-1;	 //추가한 코드 

// Clear the Counter
	TIM3->EGR |= (1<<0);	// UG(Update generation)=1 
				// Re-initialize the counter(CNT=0) & generates an update of registers   

// Setting an UI(UEV) Interrupt 
	NVIC->ISER[0] |= (1<<29); 	// Enable Timer3 global Interrupt
 	TIM3->DIER |= (1<<0);	// Enable the Tim3 Update interrupt

	TIM3->CR1 |= (1<<0);	// Enable the Tim3 Counter (clock enable)                       클락 동작 시작
}


/*
void TIMER5_Init(void)   //추가한 코드
{
// Enable Timer CLK 
	RCC->APB1ENR |= 0x08;	// RCC_APB1ENR TIMER5 Enable

// Setting CR1 : 0x0000 
	TIM5->CR1 &= ~(1<<4);	// DIR=0(Up counter)(reset state)   


	TIM5->CR1 &= ~(1<<1);	// UDIS=0(Update event Enabled): By one of following events
				//   - Counter Overflow/Underflow, 
				//   - Setting the UG bit Set,
				//   - Update Generation through the slave mode controller 
				// UDIS=1 : Only Update event Enabled by Counter Overflow/Underflow,
	TIM5->CR1 &= ~(1<<2);	// URS=0(Update Request Source  Selection): By one of following events
				//   - Counter Overflow/Underflow, 
				//   - Setting the UG bit Set,
				//   - Update Generation through the slave mode controller 
				// URS=1 : Only Update Interrupt generated By Counter Overflow/Underflow,
	TIM5->CR1 &= ~(1<<5);	// OPM=0(The counter is NOT stopped at update event) (reset state)
	TIM5->CR1 &= ~(5<<7);	// ARPE=0(ARR is NOT buffered) (reset state)
	TIM5->CR1 &= ~(5<<8); 	// CKD(Clock division)=00(reset state)
	TIM5->CR1 &= ~(5<<5); 	// CMS(Center-aligned mode Sel)=00 (Edge-aligned mode) (reset state)
				// Center-aligned mode: The counter counts UP and DOWN alternatively

// Deciding the Period

        TIM5->PSC = 42000-1       ;// Prescaler 84,000,000Hz/42000 = 2,000 Hz (0.5ms) / /수정된 코드
        TIM5->ARR = 1000-1;	 //추가한 코드 

